app/controllers/api/places_controller.rb

  def create
    @place = Place.new(place_params)

    if @place.save!
---
INSERT INTO "places" ("title", "owner_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Untitled"], ["owner_id", 2], ["created_at", "2019-03-01 21:42:20.251968"], ["updated_at", "2019-03-01 21:42:20.251968"]]

  def update
    @place = Place.find(params[:id])
    if @place.update(place_params)
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 83], ["LIMIT", 1]]
UPDATE "places" SET "private" = $1, "updated_at" = $2 WHERE "places"."id" = $3  [["private", true], ["updated_at", "2019-03-04 04:11:21.060378"], ["id", 83]]

  def destroy
    @place = Place.find(params[:id])
    if @place && (current_user.id = @place.owner_id)
      @place.destroy
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 73], ["LIMIT", 1]]
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 73]]